Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Some non-standard HTTP extensions (e.g., [RFC4559]) have been known to violate this requirement, resulting in security and interoperability problems.
zh_cn: 已知一些非标准 HTTP 扩展(例如，[RFC4559])违反了该要求，导致安全性和互操作性问题。

source: Some of the functionality described is not applicable to all URI schemes, and some operations are only possible when certain media types are retrieved using the URI, regardless of the scheme used.
zh_cn: 所描述的某些功能不适用于所有 URI 方案，并且某些操作仅在使用 URI 检索某些媒体类型时才可能，无论使用何种方案。

source: Some of this metainformation is OPTIONAL; some might be REQUIRED by portions of this specification.
zh_cn: 这些元信息中的一些是可选的；有些可能是本规范的部分内容所必需的。

source: Some operator overloads have been renamed with a postfix, such as `fromArray`, `fromIterable` etc.
zh_cn: 一些操作符重载已使用后缀重命名，例如 `fromArray`，`fromIterable` 等。

source: Some operators also allow for an interface between the Observable world and the Single world so that you can mix the two varieties:
zh_cn: 一些操作符还允许 Obse​​rvable 世界和 Single 世界之间的接口，以便您可以混合两种变体：

source: Some operators that produced exactly one value or an error now return `Single` in 2.x (or `Maybe` if an empty source is allowed).
zh_cn: 一些只生成一个值或错误的操作符现在在 2.x 中返回 `Single`(如果允许空源，则返回 `Maybe`)。

source: Some other (unspecified) issue arose in processing the certificate, rendering it unacceptable.
zh_cn: 在处理证书时出现了一些其他(未指明的)问题，使其无法接受。

source: Some protocol elements allow only the absolute form of a URI without a fragment identifier.
zh_cn: 某些协议元素仅允许没有片段标识符的 URI 的绝对形式。

source: Some proxies are designed to apply transformations to selected messages or payloads while they are being forwarded, as described in Section 5.7.2.
zh_cn: 某些代理设计用于在转发时将转换应用于选定的消息或有效载荷，如第 5.7.2 节中所述。

source: Some schemes do not allow the userinfo and/or port subcomponents.
zh_cn: 某些方案不允许 userinfo 和/或端口子组件。

source: Some sources block or start emitting items right away in this state.
zh_cn: 某些来源在此状态下会立即阻止或开始发射项目。

source: Some translations are minimal, such as for proxy requests for "http" URIs, whereas other requests might require translation to and from entirely different application-level protocols.
zh_cn: 某些转换是最小的，例如对于“http”URI 的代理请求，而其他请求可能需要从完全不同的应用程序级协议进行转换。

source: Sometimes such overflows happen due to bursty sources.
zh_cn: 有时这种溢出是由于突发源而发生的。

source: Sometimes though, multiple sources may fail at which point there is a choice whether or not wait for all of them to complete or fail.
zh_cn: 但有时候，多个来源可能会失败，此时可以选择是否等待所有来源完成或失败。

source: Sometimes, a source or service returns a different type than the flow that is supposed to work with it.
zh_cn: 有时，源或服务返回的类型与应该使用它的流不同。

source: Sometimes, a suffix is added to avoid logical ambiguities that may compile but produce the wrong type in a flow:
zh_cn: 有时，会添加一个后缀以避免可能编译但在流中产生错误类型的逻辑歧义：

source: Sometimes, the data source to be converted into the reactive world itself is synchronous (blocking) and pull-like, that is, we have to call some `get` or `read` method to get the next piece of data.
zh_cn: 有时，要转换为响应世界本身的数据源是同步的(阻塞)和拉式的，也就是说，我们必须调用一些 `get` 或 `read` 方法来获取下一个数据。

source: Sometimes, the source to be wrapped into an `Flowable` is already hot (such as mouse moves) or cold but not backpressurable in its API (such as an asynchronous network callback).
zh_cn: 有时，被包装成 `Flowable` 的源已经是热源(例如鼠标移动)或是冷源但在其 API 中不能背压(例如异步网络回调)。

source: Sometimes, there is an implicit data dependency between the previous sequence and the new sequence that, for some reason, was not flowing through the "regular channels".
zh_cn: 有时，前一个序列和新序列之间存在隐含的数据依赖性，由于某种原因，它不会流经“常规通道”。

source: Sometimes, when an item has become available, one would like to perform some dependent computations on it.
zh_cn: 有时，当项目可用时，人们希望对其执行一些依赖计算。

source: Specialty Observables that have more precisely-controlled subscription dynamics
zh_cn: 具有更精确控制的订阅动态的特殊 Observables

source: Specific repetition: "<n>(element)" is equivalent to "<n>*<n>(element)"; that is, exactly <n> occurrences of (element).
zh_cn: 具体重复：“<n>(element)”相当于“<n>*<n>(element)”;也就是说，<element> 恰好是 <n> 次出现。

source: Specifically, if the server fails to decrypt a 0-RTT record following an accepted "early_data" extension, it MUST terminate the connection with a "bad_record_mac" alert as per Section 5.2.
zh_cn: 具体来说，如果服务器无法在接受的“early_data”扩展后解密 0-RTT 记录，则必须根据第 5.2 节以“bad_record_mac”警报终止连接。

source: Specifically, it does not prevent an attacker that can observe the handshake from performing a brute-force attack on the password/pre-shared key.
zh_cn: 具体来说，它不会阻止可以观察到握手的攻击者对密码/预共享密钥执行暴力攻击。

source: Specifically, the body of the "status_request" extension from the server MUST be a CertificateStatus structure as defined in [RFC6066], which is interpreted as defined in [RFC6960].
zh_cn: 具体来说，来自服务器的“status_request”扩展的主体必须是 [RFC6066] 中定义的 CertificateStatus 结构，其解释如 [RFC6960] 中所定义。

source: Specifically, the secure channel should provide the following properties:
zh_cn: 具体而言，安全通道应提供以下属性：

source: Specifically:
zh_cn: 特别：

source: Specifies the pseudorandom function (PRF) used to generate keying material, the bulk data encryption algorithm (such as null, AES, etc.) and the MAC algorithm (such as HMAC-SHA1).
zh_cn: 指定用于生成密钥材料的伪随机函数(PRF)，批量数据加密算法(如 null，AES 等)和 MAC 算法(如 HMAC-SHA1)。

source: Spiders, for example, are typically given a start URI and configured to follow certain behavior while crawling the Web as a hypertext graph.
zh_cn: 例如，蜘蛛通常被赋予一个起始 URI，并被配置为在将 Web 作为超文本图形爬行时遵循某些行为。

source: Square brackets enclose optional elements; "[foo bar]" is equivalent to "*1(foo bar)".
zh_cn: 方括号包含可选元素；“[foo bar]”相当于“*1(foo bar)”。

source: Start Line
zh_cn: 起始行

source: Status Code Definitions
zh_cn: 状态码定义

source: Status Code Registry
zh_cn: 状态代码注册

source: Status Code and Reason Phrase
zh_cn: 状态代码和原因短语

source: Status Line
zh_cn: 状态行

source: Status of This Memo
zh_cn: 本备忘录的状态

source: Status of this Memo
zh_cn: 本备忘录的状态

source: Status-Line
zh_cn: 状态行

source: Store the return value from that method in a variable.
zh_cn: 将该方法的返回值存储在变量中。

source: Stream ciphers (including BulkCipherAlgorithm.null; see Appendix A.6) convert TLSCompressed.fragment structures to and from stream
zh_cn: 流加密(包括 BulkCipherAlgorithm.null;参见附录 A.6)将 TLSCompressed.fragment 结构转换为流和从流转换

source: String-based parsers can only be safely used within protocol elements after the element has been extracted from the message, such as within a header field-value after message parsing has delineated the individual fields.
zh_cn: 在从消息中提取元素之后，只能在协议元素内安全地使用基于字符串的解析器，例如在消息解析描述了各个字段之后的首部字段值内。

source: Structure definitions may be embedded.
zh_cn: 可以嵌入结构定义。

source: Structure of this message:
zh_cn: 此消息的结构：

source: Structure types may be constructed from primitive types for convenience.
zh_cn: 为方便起见，可以从原始类型构造结构类型。

source: Structures V1 and V2 in the variants example (Section 3.8) demonstrate this.
zh_cn: 变体示例(第 3.8 节)中的结构 V1 和 V2 证明了这一点。

source: Subsequent Handshake:
zh_cn: 后续握手：

source: Such a message indicates to the site B TCP that something is wrong, and it is expected to abort the connection.
zh_cn: 这样的消息向站点 B TCP 指示出现了问题，并且预计会中止连接。

source: Such a message might indicate an attempt to perform request smuggling (Section 9.5) or response splitting (Section 9.4) and ought to be handled as an error.
zh_cn: 这样的消息可能表示尝试执行请求走私(第 9.5 节)或响应拆分(第 9.4 节)，并且应该作为错误处理。

source: Such a name consists of a sequence of domain labels separated by ".", each domain label starting and ending with an alphanumeric character and possibly also containing "-" characters.
zh_cn: 这样的名称由一系列以“.”分隔的域标签组成，每个域标签以字母数字字符开头和结尾，可能还包含“ - ”字符。

source: Such a segment must be preceded by a dot-segment (e.g., "./this:that") to make a relative-path reference.
zh_cn: 这样的片段必须以点片段开头(例如，“./this:that”)以进行相对路径引用。

source: Such a situation could arise if the most preferred groups are new and unlikely to be supported in enough places to make pregenerating key shares for them efficient.
zh_cn: 如果最优选的群体是新的并且不太可能在足够的地方得到支持以使其有效的预生成关键份额，则可能出现这种情况。

source: Such an Observable does not begin emitting items until its Connect method is called, whether or not any observers have subscribed to it.
zh_cn: 这样的 Observable 在调用 Connect 方法之前不会开始发射项目，无论是否有任何观察者订阅了它。

source: Such an extension (say, of type x) would require the client to first send an extension of type x in a ClientHello with empty extension_data to indicate that it supports the extension type.
zh_cn: 这样的扩展(例如，类型 x)将要求客户端首先在具有空 extension_data 的 ClientHello 中发送类型 x 的扩展，以指示它支持扩展类型。

source: Such connections will automatically become reset if an attempt is made to send data in either direction.
zh_cn: 如果尝试向任一方向发送数据，则此类连接将自动重置。

source: Such errors are routed to the `RxJavaPlugins.onError` handler.
zh_cn: 这些错误被路由到 `RxJavaPlugins.onError` 处理程序。

source: Such leading or trailing LWS MAY be removed without changing the semantics of the field value.
zh_cn: 这样的前导或尾随 LWS 可以在不改变字段值语义的情况下删除。

source: Such protocol downgrades SHOULD NOT be performed unless triggered by specific client attributes, such as when one or more of the request header fields (e.g., User-Agent) uniquely match the values sent by a client known to be in error.
zh_cn: 除非由特定客户端属性触发，例如当一个或多个请求首部字段(例如，用户代理)唯一地匹配由已知错误的客户端发送的值时，否则不应执行这样的协议降级。

source: Such qualification is not required if the target of the assignment is well specified.
zh_cn: 如果指定的目标明确规定，则不需要这种限定。

source: Such references are primarily intended for human interpretation rather than for machines, with the assumption that context-based heuristics are sufficient to complete the URI (e.g., most registered names beginning with "www" are likely to have a URI prefix of "http://").
zh_cn: 这些引用主要用于人工解释而不是机器，假设基于上下文的启发式方法足以完成 URI(例如，以“www”开头的大多数注册名称可能具有 URI 前缀“http://“)。

source: Such rendering will assist the user in cases where the userinfo has been misleadingly crafted to look like a trusted domain name (Section 7.6).
zh_cn: 在 userinfo 被误导性地制作成看起来像可信域名的情况下，此类呈现将帮助用户(第 7.6 节)。

source: Suddenly, the user taps the screen too quickly and `observeOn`'s default 16-element internal buffer on Android overflows.
zh_cn: 突然，用户太快地点击了屏幕，Android 上的 `observeOn` 的默认 16 元素内部缓冲区溢出。

source: Suffix Reference
zh_cn: 后缀引用

source: Support will probably become a SHOULD NOT in the future.
zh_cn: 支持可能会在未来成为 SHOULD NOT。

source: Suppose, for example, that a connection is opened starting with sequence number S. Suppose that this connection is not used much and that eventually the initial sequence number function (ISN(t)) takes on a value equal to the sequence number, say S1, of the last segment sent by this TCP on a particular connection.
zh_cn: 例如，假设从序列号 S 开始打开连接。假设此连接使用不多，并且最终初始序列号函数(ISN(t))采用等于序列号的值，例如 S1，此 TCP 在特定连接上发送的最后一个报文段。

source: Surprising to some, this prints 1 twice instead of printing 1 and 2 respectively.
zh_cn: 令某些人感到惊讶的是，这打印 1 次，而不是分别打印 1 和 2。

source: Symbolically,
zh_cn: 象征性的，

source: Symmetric cryptography is used for data encryption (e.g., AES [AES], RC4 [SCH], etc.).
zh_cn: 对称加密用于数据加密(例如，AES [AES]，RC4 [SCH] 等)。

source: Syntactically, the two types of message differ only in the start-line, which is either a request-line (for requests) or a status-line (for responses), and in the algorithm for determining the length of the message body (Section 3.3).
zh_cn: 从语法上讲，这两种类型的消息只在起始行上以及在确定消息体长度的算法中( 3.3)有所不同，起始行是请求行(对于请求)或状态行(对于响应)。

source: Syntax Components
zh_cn: 语法组件

source: Syntax Notation
zh_cn: 语法符号

source: T.f2 refers to the second field of the previous declaration.
zh_cn: T.f2 指的是前一个声明的第二个字段。

source: TABLE OF CONTENTS
zh_cn: 目录

source: TCP A detects that the ACK field is incorrect and returns a RST (reset) with its SEQ field selected to make the segment believable.
zh_cn: TCP A 检测到 ACK 字报文段不正确并返回 RST(重置)，并选择其 SEQ 字段以使该报文段可信。

source: TCP A sees that this segment does not acknowledge anything it sent and, being unsynchronized, sends a reset (RST) because it has detected a half-open connection.
zh_cn: TCP A 看到此报文段未确认它发送的任何内容，因此不同步，所以会发送重置(RST)因为它已检测到半开连接。

source: TCP A will continue to try to establish the connection; the problem is now reduced to the basic 3-way handshake of figure 7.
zh_cn: TCP A 将继续尝试建立连接；问题现在减少到图 7 的基本三次握手。

source: TCP B aborts at line 5.
zh_cn: TCP B 在第 5 行中止。

source: TCP B accepts the reset and returns to its passive LISTEN state.
zh_cn: TCP B 接受重置并返回其被动 LISTEN 状态。

source: TCP B, in the meantime, thinks the connection is open.
zh_cn: 在此期间，TCP B 认为连接是打开的。

source: TCP B, on receiving the RST, returns to the LISTEN state.
zh_cn: 接收到 RST 后，TCP B 返回到 LISTEN 状态。

source: TCP Header Format
zh_cn: TCP 首部格式

source: TCP implementors may violate the "quiet time" restriction, but only at the risk of causing some old data to be accepted as new or new data rejected as old duplicated by some receivers in the internet system.
zh_cn: TCP 实现者可能违反“安静时间”限制，但仅有可能导致某些旧数据被接受为新的或新的数据被拒绝，因为互联网系统中的某些接收器复制旧数据。

source: TCP segments are sent as internet datagrams.
zh_cn: TCP 报文段作为 Internet 数据报发送。

source: TCP states represent the state AFTER the departure or arrival of the segment (whose contents are shown in the center of each line).
zh_cn: TCP 状态表示报文段的离开或到达之后的状态(其内容显示在每条线的中心)。

source: TCPs consume sequence number space each time a segment is formed and entered into the network output queue at a source host.
zh_cn: 每次形成一个报文段并将其输入到源主机的网络输出队列中时，TCP 会消耗序列号空间。

source: TEXT = <any OCTET except CTLs, but including LWS>
zh_cn: TEXT = <除 CTL 之外的任何 OCTET，但包括 LWS>

source: TIME-WAIT - represents waiting for enough time to pass to be sure the remote TCP received the acknowledgment of its connection termination request.
zh_cn: TIME-WAIT - 表示等待足够的时间以确保远程 TCP 收到其连接终止请求的确认。

source: TLS 1.2 clients SHOULD also check that the last 8 bytes are not equal to the second value if the ServerHello indicates TLS 1.1 or below.
zh_cn: 如果 ServerHello 指示 TLS 1.1 或更低，则 TLS 1.2 客户端还应检查最后 8 个字节是否不等于第二个值。

source: TLS 1.2 implementations SHOULD also process this extension.
zh_cn: TLS 1.2 实现应该也应该处理这个扩展。

source: TLS 1.3 ClientHello messages always contain extensions (minimally "supported_versions", otherwise, they will be interpreted as TLS 1.2 ClientHello messages).
zh_cn: TLS 1.3 ClientHello 消息始终包含扩展(最低限度为“supported_versions”，否则，它们将被解释为 TLS 1.2 ClientHello 消息)。

source: TLS 1.3 ClientHellos are identified as having a legacy_version of 0x0303 and a supported_versions extension present with 0x0304 as the highest version indicated therein.(See Appendix D for details about backward compatibility.)
zh_cn: TLS 1.3 ClientHellos 被标识为具有 0x0303 的 legacy_version 和 supported_versions 扩展，其中 0x0304 作为其中指示的最高版本。(有关向后兼容性的详细信息，请参阅附录 D.)

source: TLS 1.3 TLSCiphertexts are not generated until after TLS 1.3 has been negotiated, so there are no historical compatibility concerns where other values might be received.
zh_cn: 在协商 TLS 1.3 之后才生成 TLS 1.3 TLSCiphertexts，因此没有历史兼容性问题可能会收到其他值。

source: TLS 1.3 clients receiving a ServerHello indicating TLS 1.2 or below MUST check that the last 8 bytes are not equal to either of these values.
zh_cn: 接收指示 TLS 1.2 或更低的 ServerHello 的 TLS 1.3 客户端必须检查最后 8 个字节是否不等于这些值中的任何一个。

source: TLS 1.3 has a downgrade protection mechanism embedded in the server's random value.
zh_cn: TLS 1.3 具有嵌入在服务器随机值中的降级保护机制。

source: TLS 1.3 implementations willing to negotiate TLS 1.2 MUST behave in accordance with the requirements of [RFC5246] when negotiating that version.
zh_cn: 在协商该版本时，愿意协商 TLS 1.2 的 TLS 1.3 实现必须符合 [RFC5246] 的要求。

source: TLS 1.3 provides two extensions for indicating which signature algorithms may be used in digital signatures.
zh_cn: TLS 1.3 提供了两个扩展，用于指示可以在数字签名中使用的签名算法。

source: TLS 1.3 removed point format negotiation in favor of a single point format for each curve.
zh_cn: TLS 1.3 删除了点格式协商，支持每条曲线的单点格式。

source: TLS 1.3 servers MUST NOT act upon its presence or information in it when processing ClientHello messages; in particular, they MUST NOT send the status_request_v2 extension in the EncryptedExtensions, CertificateRequest, or Certificate messages.
zh_cn: 在处理 ClientHello 消息时，TLS 1.3 服务器不得对其存在或信息进行操作；特别是，他们不得在 EncryptedExtensions，CertificateRequest 或 Certificate 消息中发送 status_request_v2 扩展。

source: TLS 1.3 servers MUST NOT offer a SHA-1 signed certificate unless no valid certificate chain can be produced without it (see Section 4.4.2.2).
zh_cn: TLS 1.3 服务器不得提供 SHA-1 签名证书，除非没有它就不可以生成有效的证书链(参见第 4.4.2.2 节)。

source: TLS 1.3 servers MUST be able to process ClientHello messages that include it, as it MAY be sent by clients that wish to use it in earlier protocol versions.
zh_cn: TLS 1.3 服务器必须能够处理包含它的 ClientHello 消息，因为它可能由希望在早期协议版本中使用它的客户端发送。

source: TLS 1.3 servers which negotiate TLS 1.2 or below in response to a ClientHello MUST set the last 8 bytes of their Random value specially in their ServerHello.
zh_cn: 响应 ClientHello 协商 TLS 1.2 或更低版本的 TLS 1.3 服务器必须特别在其 ServerHello 中设置其 Random 值的最后 8 个字节。

source: TLS 1.3 servers will need to perform this check first and only attempt to negotiate TLS 1.3 if the "supported_versions" extension is present.
zh_cn: TLS 1.3 服务器需要首先执行此检查，并且仅在存在“supported_versions”扩展时才尝试协商 TLS 1.3。

source: TLS allows client/server applications to communicate over the Internet in a way that is designed to prevent eavesdropping, tampering, and message forgery.
zh_cn: TLS 允许客户端/服务器应用程序在互联网上通过旨在防止窃听，篡改和消息伪造的方式进行通信。

source: TLS allows extensions to follow the compression_methods field in an extensions block.
zh_cn: TLS 允许扩展遵循扩展块中的 compression_methods 字段。

source: TLS also allows other messages to be sent after the main handshake.
zh_cn: TLS 还允许在主握手之后发送其他消息。

source: TLS also allows several optimized variants of the basic handshake, as described in the following sections.
zh_cn: TLS 还允许基本握手的几种优化变体，如以下部分所述。

source: TLS consists of two primary components:
zh_cn: TLS 包含两个主要组件：

source: TLS does not hide the length of the data it transmits, though endpoints are able to pad TLS records in order to obscure lengths and improve protection against traffic analysis techniques.
zh_cn: TLS 不会隐藏它传输的数据的长度，尽管端点能够填充 TLS 记录以掩盖长度并改进对流量分析技术的保护。

source: TLS has three subprotocols that are used to allow peers to agree upon security parameters for the record layer, to authenticate themselves, to instantiate negotiated security parameters, and to report error conditions to each other.
zh_cn: TLS 有三个子协议，用于允许对等端就记录层的安全参数达成一致，对自身进行身份验证，实例化协商的安全性参数，以及相互报告错误情况。

source: TLS implementations MUST initiate an exchange of closure alerts before closing a connection.
zh_cn: TLS 实现必须在关闭连接之前启动关闭警报的交换。

source: TLS is application protocol independent; higher-level protocols can layer on top of TLS transparently.
zh_cn: TLS 是独立于应用协议的；更高级别的协议可以透明地层叠在 TLS 之上。

source: TLS only presumes a reliable connection-oriented data stream.
zh_cn: TLS 仅假定可靠的面向连接的数据流。

source: TLS provides a facility for secure connection closure.
zh_cn: TLS 提供安全连接关闭的工具。

source: TLS provides an Alert content type to indicate closure information and errors.
zh_cn: TLS 提供 Alert 内容类型以指示关闭信息和错误。

source: TLS records are typed, which allows multiple higher-level protocols to be multiplexed over the same record layer.
zh_cn: TLS 记录是类型化的，它允许在同一记录层上复用多个更高级别的协议。

source: TLS servers MUST support receiving this extension.
zh_cn: TLS 服务器必须支持接收此扩展。

source: TLS supports three basic key exchange modes:
zh_cn: TLS 支持三种基本密钥交换模式：

source: TLS uses the same set of messages every time that certificate-based authentication is needed.
zh_cn: 每次需要基于证书的身份验证时，TLS 都使用相同的消息集。

source: TLS's PRF is created by applying P_hash to the secret as:
zh_cn: 通过将 P_hash 应用于机密来创建 TLS 的 PRF：

source: TLSCiphertext.fragment structures.
zh_cn: TLSCiphertext.fragment 结构。

source: TRACE allows the client to see what is being received at the other end of the request chain and use that data for testing or diagnostic information.
zh_cn: TRACE 允许客户端查看请求链另一端收到的内容，并将该数据用于测试或诊断信息。

source: TRANSMISSION CONTROL PROTOCOL
zh_cn: TRANSMISSION CONTROL PROTOCOL 输输控制协议 没有完全翻译，并且有部分内容不太理解，可能只是单纯的机器翻译，没加修饰。 应该需要多读几遍才行。

source: Table 1 – Encoding of class of tag
zh_cn: 表 1 - 标签类的编码

source: Table of Contents
zh_cn: 目录

source: Tear-down
zh_cn: 拆除

source: Techniques like Java Futures are straightforward to use for a single level of asynchronous execution but they start to add non-trivial complexity when they’re nested.
zh_cn: 诸如 Java Futures 之类的技术可以直接用于 单层的异步操作，但是当它们嵌套时，它们开始变得 异常的复杂。

source: Terminology
zh_cn: 术语

source: Test developers are now encouraged to simply `new TestScheduler()` in their code.
zh_cn: 现在鼓励测试开发人员在他们的代码中简单地使用 `new TestScheduler()`。

source: Testing RxJava 2.x works the same way as it does in 1.x.
zh_cn: 测试 RxJava 2.x 的工作方式与 1.x 相同。

source: Tests that want to override the schedulers and the lifecycle of the base reactive types can do it on a case-by-case basis through callback functions.
zh_cn: 想要覆盖调度器和基本响应类型生命周期的测试可以通过回调函数逐个进行。

source: That abstraction is called a representation [REST].
zh_cn: 这种抽象称为表示 (representation) [REST]。

source: That is not the case in practice.
zh_cn: 实际情况并非如此。

source: That is, "(element), , (element) " is permitted, but counts as only two elements.
zh_cn: 也就是说，“(element), , (element) ”是允许的，但只计为两个元素。

source: That is, if a handshake message is split over two or more records, there MUST NOT be any other records between them.
zh_cn: 也就是说，如果握手消息被分成两个或多个记录，则它们之间不能有任何其他记录。

source: That is, the certificate_list structure has a length of zero.
zh_cn: 也就是说，certificate_list 结构的长度为零。

source: That is, unless otherwise indicated, the client SHOULD assume that the server will maintain a persistent connection, even after error responses from the server.
zh_cn: 也就是说，除非另有说明，客户端应该假设服务器将保持持久连接，即使在服务器的错误响应之后也是如此。

source: That is:
zh_cn: 即：

source: That resource might be a data-accepting process, a gateway to some other protocol, or a separate entity that accepts annotations.
zh_cn: 该资源可能是数据接受过程，某些其他协议的网关或接受注释的单独实体。

source: The "Connection" header field allows the sender to indicate desired control options for the current connection.
zh_cn: “Connection”首部字段允许发送方指示当前连接的所需控制选项。

source: The "Extension" format is defined in Section 4.2.
zh_cn: “扩展”格式在 4.2 节中定义。

source: The "Host" header field in a request provides the host and port information from the target URI, enabling the origin server to distinguish among resources while servicing requests for multiple host names on a single IP address.
zh_cn: 请求中的“Host”首部字段提供来自目标 URI 的主机和端口信息，使原始服务器能够在为单个 IP 地址上的多个主机名的请求提供服务时区分资源。

source: The "Upgrade" header field is intended to provide a simple mechanism for transitioning from HTTP/1.1 to some other protocol on the same connection.
zh_cn: “Upgrade”首部字段旨在提供一种简单的机制，用于在同一连接上从 HTTP/1.1 转换到某些其他协议。

source: The "anonymous" value is meaningless in this context but used in Section 7.4.3.
zh_cn: 在这种情况下，“anonymous”值毫无意义，但在第 7.4.3 节中使用。

source: The "certificate_authorities" extension is used to indicate the certificate authorities (CAs) which an endpoint supports and which SHOULD be used by the receiving endpoint to guide certificate selection.
zh_cn: “certificate_authorities”扩展用于指示端点支持的证书颁发机构(CA)以及接收端点应该使用哪个证书颁发机构来指导证书选择。

source: The "charset" parameter is used with some media types to define the character set (section 3.4) of the data.
zh_cn: “charset”参数与某些媒体类型一起用于定义数据的字符集(第 3.4 节)。

source: The "chunked" transfer-coding MUST NOT be applied more than once to a message-body.
zh_cn: “分块”传输编码不得多次应用于消息体。

source: The "close" connection option is defined for a sender to signal that this connection will be closed after completion of the response.
zh_cn: 为发送方定义“close”连接选项，以表示在完成响应后将关闭此连接。

source: The "close" connection option is used to signal that a connection will not persist after the current request/response.
zh_cn: “close”连接选项用于表示在当前请求/响应之后连接不会持久存在。

source: The "extension_data" field of the "post_handshake_auth" extension is zero length.
zh_cn: “post_handshake_auth”扩展的“extension_data”字段为零长度。

source: The "extension_data" field of these extensions contains a SignatureSchemeList value:
zh_cn: 这些扩展的“extension_data”字段包含 SignatureSchemeList 值：
